trade/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыДоставки</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуСоСклада</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуВПункте</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяВРаспоряжении</name>
  </enumValues>
  <enumValues>
    <name>ДоКлиентаКурьером</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СпособыДоставки/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет представление переданного способа доставки.
//
// Параметры:
//   СпособДоставки - ПеречислениеСсылка.СпособыДоставки - способ доставки для получения представления.
//
// Возвращаемое значение:
//   Строка - представление способа доставки.
//
Функция ПредставлениеСпособаДоставки(СпособДоставки) Экспорт

	ПредставленияСпособовДоставки = ПредставленияСпособовДоставки();
	
	ПредставлениеСпособаДоставки = ПредставленияСпособовДоставки[СпособДоставки];
	Если ПредставлениеСпособаДоставки = Неопределено Тогда
		ПредставлениеСпособаДоставки = Строка(СпособДоставки);
	КонецЕсли;
	
	Возврат ПредставлениеСпособаДоставки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор представлений способов доставки.
//
// Возвращаемое значение:
//   Соответствие - список представлений:
//    * Ключ - ПеречислениеСсылка.СпособыДоставки - способ доставки.
//    * Значение - Строка - представление способа доставки.
//
Функция ПредставленияСпособовДоставки()

	ПредставленияСпособовДоставки = Новый Соответствие;
	
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.Самовывоз,
											НСтр("ru = 'Самовывоз (с нашего склада)'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.ДоКлиента,
											НСтр("ru = 'Наша транспортная служба до клиента'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу,
											НСтр("ru = 'Наша транспортная служба до перевозчика'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчика,
											НСтр("ru = 'Перевозчик (с нашего склада)'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки,
											НСтр("ru = 'На усмотрение транспортной службы'"));
	
	Возврат ПредставленияСпособовДоставки;

КонецФункции

#КонецОбласти

#КонецЕсли
